### Data Engineering
We now need to create and modify some features, embedd categorical variables, scale them etc.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('dataset.csv')
df.head()

,Match Runs,Match SR,Total Runs,Total Balls,Ave,Career SR,HS,NO,0,50,100,Opposition,Ground,match_id,player_id,m1,m2,m3,m4,m5
0,19.0,54.28,66.0,115,14.16,73.91,36.0,0,2,0,0,England,Leeds,634,35320,0.0,0.0,36.0,10.0,20.0
1,31.0,119.23,85.0,141,16.57,82.26,36.0,0,2,0,0,England,Nottingham,635,35320,0.0,36.0,10.0,20.0,19.0
2,36.0,163.63,116.0,163,19.00,93.25,36.0,0,2,0,0,Sri Lanka,Nagpur,644,35320,36.0,10.0,20.0,19.0,31.0
3,53.0,129.26,152.0,204,22.77,100.49,53.0,0,2,0,0,Sri Lanka,Pune,646,35320,10.0,20.0,19.0,31.0,36.0
4,30.0,103.44,205.0,233,23.50,100.85,53.0,0,2,1,0,Sri Lanka,Margao,648,35320,20.0,19.0,31.0,36.0,53.0

We need to subtract match runs from the total runs for it to be only past data.we also need to remove notout sign * from the match runs column

We should now select between Total Balls faced or Career SR. We can simply choose SR because it is a scaled varibale and is bound to be in between 0-100. We should drop Match SR because it is of no real use to us.

In [3]:
df.drop(['Total Balls', 'Match SR'], axis=1, inplace=True)

We now need to enocode all of the 50s, 100s, 0s, and NO columns into atmost one column. Let's start by giving 50's a weight of 10 and 100's a 20 and 0's a -5 and Notouts a 5.

In [4]:
df['Records'] = df['100']*20 + df['50']*10 - df['0']*5 + df['NO']*5

We have no use of Player ID and Match ID so we can drop all these non essential columns

In [5]:
df.drop(['100', '50', '0', 'NO', 'player_id', 'match_id'], axis=1, inplace=True)
df.head()

,Match Runs,Total Runs,Ave,Career SR,HS,Opposition,Ground,m1,m2,m3,m4,m5,Records
0,19.0,66.0,14.16,73.91,36.0,England,Leeds,0.0,0.0,36.0,10.0,20.0,-10
1,31.0,85.0,16.57,82.26,36.0,England,Nottingham,0.0,36.0,10.0,20.0,19.0,-10
2,36.0,116.0,19.00,93.25,36.0,Sri Lanka,Nagpur,36.0,10.0,20.0,19.0,31.0,-10
3,53.0,152.0,22.77,100.49,53.0,Sri Lanka,Pune,10.0,20.0,19.0,31.0,36.0,-10
4,30.0,205.0,23.50,100.85,53.0,Sri Lanka,Margao,20.0,19.0,31.0,36.0,53.0,0

In [6]:
from sklearn.preprocessing import StandardScaler, LabelEncoder, MinMaxScaler
df.Opposition.unique()

array(['England', 'Sri Lanka', 'Pakistan', 'West Indies', 'South Africa',
       'Australia', 'Zimbabwe', 'New Zealand', 'U.A.E.', 'Bangladesh',
       'Kenya', 'Netherlands', 'Namibia', 'Bermuda', 'Ireland', 'India',
       'Canada', 'ICC World XI', 'Africa XI', 'Afghanistan', 'Scotland',
       'U.S.A.', 'Asia XI', 'Hong Kong', 'P.N.G.'], dtype=object)

In [7]:
df.Ground.unique()

array(['Leeds', 'Nottingham', 'Nagpur', 'Pune', 'Margao', 'Cuttack',
       'Kolkata', 'Sharjah', 'Gwalior', 'New Delhi', 'Perth', 'Hobart',
       'Adelaide', 'Brisbane', 'Sydney', 'Melbourne', 'Hamilton',
       'Wellington', 'Dunedin', 'Harare', 'Cape Town', 'Port Elizabeth',
       'Centurion', 'Johannesburg', 'Bloemfontein', 'Durban',
       'East London', 'Jaipur', 'Chandigarh', 'Bengaluru', 'Jamshedpur',
       'Faridabad', 'Guwahati', 'Colombo (RPS)', 'Moratuwa', 'Kanpur',
       'Ahmedabad', 'Indore', 'Mohali', 'Rajkot', 'Hyderabad (Deccan)',
       'Jalandhar', 'Napier', 'Auckland', 'Christchurch', 'Colombo (SSC)',
       'Mumbai', 'Chennai', 'Vadodara', 'Delhi', 'Visakhapatnam',
       'Amritsar', 'Mumbai (BS)', 'Singapore', 'The Oval', 'Manchester',
       'Toronto', 'Paarl', 'Benoni', 'Bulawayo', 'Port of Spain',
       'Kingstown', 'Bridgetown', 'Hyderabad (Sind)', 'Karachi', 'Lahore',
       'Dhaka', 'Kochi', 'Taupo', 'Hove', 'Bristol', 'Taunton',
       'Birmingham', 'Galle', 'Nairobi (Gym)', 'Jodhpur', "Lord's",
       'Chester-le-Street', 'Pietermaritzburg', 'Rawalpindi', 'Peshawar',
       'Dambulla', 'Chattogram', 'Multan', 'Kuala Lumpur', 'Belfast',
       'Southampton', 'Canberra', 'Tangier', 'Kimberley',
       'Melbourne (Docklands)', 'Queenstown', 'Bogra', 'Amstelveen',
       'Providence', 'North Sound', "St George's", 'Kingston',
       'Colombo (PSS)', 'Gros Islet', 'Hambantota', 'Pallekele',
       'Dubai (DSC)', 'Abu Dhabi', 'Cardiff', 'Fatullah', 'Nelson',
       'Georgetown', 'Worcester', 'Potchefstroom', 'Cairns', 'Darwin',
       'Canterbury', 'Basseterre', 'Dublin', 'Sargodha', 'New Plymouth',
       'Ballarat', 'Kandy', 'Patna', 'Gujranwala', 'Faisalabad',
       'Nairobi (Club)', 'Northampton', 'Edinburgh', 'Ranchi',
       'Dharamsala', 'Thiruvananthapuram', 'Mount Maunganui', 'Sialkot',
       'Sheikhupura', 'Derby', "St John's", 'Chelmsford', 'Roseau',
       'Leicester', 'Vijayawada', 'Glasgow', 'Nairobi', 'King City (NW)',
       'Khulna', 'Whangarei', 'Berri', 'Nairobi (Aga)', 'Quetta',
       'Aberdeen', 'Dublin (Malahide)', 'Sylhet', 'Srinagar', 'Deventer',
       'Bready', 'Albion', 'Castries', 'Mombasa'], dtype=object)

lets scale the data for match runs, total runs, average, HS, m to m5 and records. We can leave average, SR as they are almost scaled and Opoosition, Ground which are categorical

In [8]:
df.to_csv('final_dataset.csv', index=False)